Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ128MC510.h
#define _C1BUFPNT4_F12BP1_POSITION               0x00000001
#define _C1BUFPNT4_F12BP1_MASK                   0x00000002
#define _C1BUFPNT4_F12BP1_LENGTH                 0x00000001

#define _C1BUFPNT4_F12BP2_POSITION               0x00000002
#define _C1BUFPNT4_F12BP2_MASK                   0x00000004
#define _C1BUFPNT4_F12BP2_LENGTH                 0x00000001

#define _C1BUFPNT4_F12BP3_POSITION               0x00000003
#define _C1BUFPNT4_F12BP3_MASK                   0x00000008
#define _C1BUFPNT4_F12BP3_LENGTH                 0x00000001

#define _C1BUFPNT4_F13BP0_POSITION               0x00000004
#define _C1BUFPNT4_F13BP0_MASK                   0x00000010
#define _C1BUFPNT4_F13BP0_LENGTH                 0x00000001

#define _C1BUFPNT4_F13BP1_POSITION               0x00000005
#define _C1BUFPNT4_F13BP1_MASK                   0x00000020
#define _C1BUFPNT4_F13BP1_LENGTH                 0x00000001

#define _C1BUFPNT4_F13BP2_POSITION               0x00000006
#define _C1BUFPNT4_F13BP2_MASK                   0x00000040
#define _C1BUFPNT4_F13BP2_LENGTH                 0x00000001

#define _C1BUFPNT4_F13BP3_POSITION               0x00000007
#define _C1BUFPNT4_F13BP3_MASK                   0x00000080
#define _C1BUFPNT4_F13BP3_LENGTH                 0x00000001

#define _C1BUFPNT4_F14BP0_POSITION               0x00000008
#define _C1BUFPNT4_F14BP0_MASK                   0x00000100
#define _C1BUFPNT4_F14BP0_LENGTH                 0x00000001

#define _C1BUFPNT4_F14BP1_POSITION               0x00000009
#define _C1BUFPNT4_F14BP1_MASK                   0x00000200
#define _C1BUFPNT4_F14BP1_LENGTH                 0x00000001

#define _C1BUFPNT4_F14BP2_POSITION               0x0000000A
#define _C1BUFPNT4_F14BP2_MASK                   0x00000400
#define _C1BUFPNT4_F14BP2_LENGTH                 0x00000001

#define _C1BUFPNT4_F14BP3_POSITION               0x0000000B
#define _C1BUFPNT4_F14BP3_MASK                   0x00000800
#define _C1BUFPNT4_F14BP3_LENGTH                 0x00000001

#define _C1BUFPNT4_F15BP0_POSITION               0x0000000C
#define _C1BUFPNT4_F15BP0_MASK                   0x00001000
#define _C1BUFPNT4_F15BP0_LENGTH                 0x00000001

#define _C1BUFPNT4_F15BP1_POSITION               0x0000000D
#define _C1BUFPNT4_F15BP1_MASK                   0x00002000
#define _C1BUFPNT4_F15BP1_LENGTH                 0x00000001

#define _C1BUFPNT4_F15BP2_POSITION               0x0000000E
#define _C1BUFPNT4_F15BP2_MASK                   0x00004000
#define _C1BUFPNT4_F15BP2_LENGTH                 0x00000001

#define _C1BUFPNT4_F15BP3_POSITION               0x0000000F
#define _C1BUFPNT4_F15BP3_MASK                   0x00008000
#define _C1BUFPNT4_F15BP3_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF0_POSITION                0x00000000
#define _C1RXOVF1_RXOVF0_MASK                    0x00000001
#define _C1RXOVF1_RXOVF0_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF1_POSITION                0x00000001
#define _C1RXOVF1_RXOVF1_MASK                    0x00000002
#define _C1RXOVF1_RXOVF1_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF2_POSITION                0x00000002
#define _C1RXOVF1_RXOVF2_MASK                    0x00000004
#define _C1RXOVF1_RXOVF2_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF3_POSITION                0x00000003
#define _C1RXOVF1_RXOVF3_MASK                    0x00000008
#define _C1RXOVF1_RXOVF3_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF4_POSITION                0x00000004
#define _C1RXOVF1_RXOVF4_MASK                    0x00000010
#define _C1RXOVF1_RXOVF4_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF5_POSITION                0x00000005
#define _C1RXOVF1_RXOVF5_MASK                    0x00000020
#define _C1RXOVF1_RXOVF5_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF6_POSITION                0x00000006
#define _C1RXOVF1_RXOVF6_MASK                    0x00000040
#define _C1RXOVF1_RXOVF6_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF7_POSITION                0x00000007
#define _C1RXOVF1_RXOVF7_MASK                    0x00000080
#define _C1RXOVF1_RXOVF7_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF8_POSITION                0x00000008
#define _C1RXOVF1_RXOVF8_MASK                    0x00000100
#define _C1RXOVF1_RXOVF8_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF9_POSITION                0x00000009
#define _C1RXOVF1_RXOVF9_MASK                    0x00000200
#define _C1RXOVF1_RXOVF9_LENGTH                  0x00000001

#define _C1RXOVF1_RXOVF10_POSITION               0x0000000A
#define _C1RXOVF1_RXOVF10_MASK                   0x00000400
#define _C1RXOVF1_RXOVF10_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF11_POSITION               0x0000000B
#define _C1RXOVF1_RXOVF11_MASK                   0x00000800
#define _C1RXOVF1_RXOVF11_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF12_POSITION               0x0000000C
#define _C1RXOVF1_RXOVF12_MASK                   0x00001000
#define _C1RXOVF1_RXOVF12_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF13_POSITION               0x0000000D
#define _C1RXOVF1_RXOVF13_MASK                   0x00002000
#define _C1RXOVF1_RXOVF13_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF14_POSITION               0x0000000E
#define _C1RXOVF1_RXOVF14_MASK                   0x00004000
#define _C1RXOVF1_RXOVF14_LENGTH                 0x00000001

#define _C1RXOVF1_RXOVF15_POSITION               0x0000000F
#define _C1RXOVF1_RXOVF15_MASK                   0x00008000
#define _C1RXOVF1_RXOVF15_LENGTH                 0x00000001

#define _C1RXOVF2_RXOVF16_POSITION               0x00000000
#define _C1RXOVF2_RXOVF16_MASK                   0x00000001
#define _C1RXOVF2_RXOVF16_LENGTH                 0x00000001

#define _C1RXOVF2_RXOVF17_POSITION               0x00000001
#define _C1RXOVF2_RXOVF17_MASK                   0x00000002
#define _C1RXOVF2_RXOVF17_LENGTH                 0x00000001

#define _C1RXOVF2_RXOVF18_POSITION               0x00000002
#define _C1RXOVF2_RXOVF18_MASK                   0x00000004
#define _C1RXOVF2_RXOVF18_LENGTH                 0x00000001

